EXAMP: PROC OPTIONS (MAIN);                                                     DCL A BIN FIXED (31) INIT ( 11B );                                              DCL B BIN FIXED (31) INIT ( 100B );                                             DCL C BIN FIXED (31) INIT ( 101B );                                             DCL D BIN FIXED (31);                                                           D = A + B - C;                                                                  END EXAMP;                                                                      